{"pageProps":{"blogPage":{"frontMatter":{"title":"My weekly thoughts","subtitle":"Blog"},"content":""},"blogPosts":[{"slug":"Apache-on-Ubuntu-22.04-Using-Docker","frontMatter":{"title":"How to Install Apache on Ubuntu 22.04 Using Docker","description":"Apache is one of the most widely used web servers, providing a robust platform for hosting websites and web applications.","image":"/images/blog/09.jpg","date":"2023-05-23","category":"Server"},"content":"\n\n\nApache is one of the most widely used web servers, providing a robust platform for hosting websites and web applications. With the power of Docker, you can easily run Apache in an isolated container, making your setup portable and quick to deploy. In this blog post, we will walk you through the steps to install and run Apache on Ubuntu 22.04 using Docker. This setup is perfect for testing, development, or production environments.\n\n## What You'll Learn.\n\n\nIn this guide, you'll learn:\n\n1.  How to install Docker on Ubuntu 22.04.\n2.  How to pull and run Apache in a Docker container.\n3.  Basic management of your Apache Docker container.\n4.  How to troubleshoot any potential issues during the setup.\n\n## Step 1 Install Docker on Ubuntu 22.04\n\nBefore we begin setting up Apache, we need to ensure that Docker is installed on your system. Docker allows us to run Apache within a container, providing a lightweight and efficient environment. Follow these steps to get Docker up and running:\n\n1.1 Update Your System\n\nStart by updating your package lists to make sure you’re working with the latest versions of the software.\n\n```bash\nsudo apt update\nsudo apt upgrade -y\n```\n\n1.2 Install Required Dependencies\n\nNext, we’ll install some necessary dependencies to allow Docker to be added to the system.\n\n```bash\nsudo apt install -y apt-transport-https ca-certificates curl software-properties-common\n```\n\n1.3 Add Docker’s Official GPG Key\n\nNow, you need to add Docker’s official GPG key to your system so it can verify the Docker package authenticity.\n\n\n**curl -fsSL https://download.docker.com/linux/ubuntu/gpg | sudo gpg --dearmor -o /usr/share/keyrings/docker-archive-keyring.gpg**\n\n1.4 Add Docker’s Repository\n\nAdd Docker’s official repository to your system’s list of sources, so you can install the latest version of Docker from it.\n\n\n**echo \"deb [arch=$(dpkg --print-architecture) signed-by=/usr/share/keyrings docker-archive-keyring.gpg] https://download.docker.com/linux/ubuntu $(lsb_release -cs) stable\" | sudo tee /etc/apt/sources.list.d/docker.list > /dev/null**\n\n\n1.5 Install Docker\n\nNow you can install Docker. After updating your package list, install Docker using the following command:\n\n```bash\nsudo apt update\nsudo apt install -y docker-ce docker-ce-cli containerd.io\n```\n\n1.6 Verify Docker Installation\n\nTo confirm Docker was installed successfully, check the version of Docker installed:\n\n```bash\nsudo docker --version\n```\n## Step 2 Run Apache in a Docker Container\n\nNow that Docker is installed, it's time to pull the official Apache image and run it in a container. Docker makes it incredibly easy to run a fully functional Apache web server without the need to configure anything manually.\n\n2.1 Pull the Official Apache Image\n\nDocker Hub has a ready-to-use official Apache image, so you don't have to create one from scratch. Pull the image by running:\n\n```bash\nsudo docker pull httpd\n```\n2.2 Run Apache in a Docker Container\n\nWith the Apache image pulled, we can now run it in a container. This will start Apache and bind it to your machine's port 8080:\n\n```bash\nsudo docker run -d -p 8080:80 --name apache-server httpd\n```\n-d: Runs the container in detached mode (in the background).\n-p 8080:80: Maps port 80 inside the container (the default Apache port) to port 8080 on your host machine.\n--name apache-server: Names your container \"apache-server\" for easy reference.\n\n2.3 Verify the Apache Container is Running\n\nTo check if your container is running properly, you can use:\n```bash\nsudo docker ps\n```\nThis command will list all running containers, and you should see your apache-server container in the list.\n\n2.4 Access Apache in Your Browser\n\nNow, open your browser and navigate to http://localhost:8080 or http://<your-server-ip>:8080 (if you're working on a remote machine). You should see the default Apache welcome page, which indicates that Apache is running inside the Docker container.\n\n## Step 3 Managing Your Apache Docker Container\n\nOnce your Apache server is running, you may need to perform some basic container management tasks. Here are some useful commands:\n\n3.1 Stop the Apache Container\n\nIf you need to stop the Apache container, you can use the following command:\n\n```bash\nsudo docker stop apache-server\n```\n3.2 Start the Apache Container Again\n\nTo start the container again after stopping it:\n\n```bash\nsudo docker start apache-server\n```\n\n3.3 Remove the Apache Container\n\nIf you want to remove the container (for example, when cleaning up), use this command:\n\n```bash\nsudo docker rm apache-server\n```\n3.4 View Apache Logs\n\nTo view the logs generated by Apache inside the container:\n\n```bash\nsudo docker logs apache-server\n```\n\n## Step 4 Customize Your Apache Setup\n\nAt this point, you have Apache running in Docker with its default configuration. However, Docker allows for greater flexibility, enabling you to configure Apache further. You can mount configuration files or a custom website directory into your container, or even create a custom Dockerfile to suit your specific needs.\n\n4.1 Mounting Local Directories to Docker\n\nIf you want to serve your custom website, you can mount your local directory to the Apache container:\n```bash\nsudo docker run -d -p 8080:80 -v /path/to/your/website:/usr/local/apache2/htdocs/ --name apache-server httpd\n```\nThis command mounts the website directory on your host machine to the htdocs folder in the Apache container, where Apache looks for files to serve.\n\n## Troubleshooting Common Issues\n\nDocker Image Pull Failures: Ensure you have a stable internet connection. If you encounter issues while pulling the Apache image, try running docker system prune to clear unused data and try again.\nPort Conflicts: If port 8080 is already in use, you can change the host port (e.g., -p 8081:80) when running the container.\nApache Errors: To check for any issues with Apache itself, use docker logs apache-server to view the container's log output.\n\n## Conclusion\nCongratulations! You’ve successfully set up Apache on Ubuntu 22.04 using Docker. This method is a clean and efficient way to run a web server, with the added benefits of Docker’s portability and ease of use. You can now scale your Apache setup, customize it, or even deploy it in production with minimal effort. Docker makes managing your server environments a breeze, and using Apache in a containerized environment is a powerful choice for modern web hosting.\n\nIf you want to take it a step further, you can integrate Docker Compose to manage multi-container applications or even link Apache with a MySQL or PHP container for dynamic website hosting.\n\nHappy coding, and enjoy your new Apache web server!"}]},"__N_SSG":true}