{"pageProps":{"currentProject":{"slug":"quote","frontMatter":{"date":"10-10-2017","title":"Quote","lang":"Build with React","description":"React frontend app using Firebase for backend and Sass for styling. Redux manages state","image":"/images/project/01.jpg","color":"#67A94C","category":"Frontend","projectInfo":[{"title":"Client","data":"World wide"},{"title":"Release date","data":"06-05-2023"},{"title":"Tehnology","data":"- React\n- SASS\n- FireBase\n- Redux\n"},{"title":"Functions","data":"- Post Like\n- User Account\n- Activity track\n- Share post   \n"}],"live":[{"link":"https://quote.gabrielchiorcea.tech/"}]},"content":"\r\n\r\n\r\n## Arhitecture. \r\n[Acces live](https://quote.gabrielchiorcea.tech/).\r\n\r\nThis project is a standalone frontend application built with React, focusing on delivering a streamlined user experience. It does not have a dedicated backend; instead, it relies on Firebase as a Backend-as-a-Service (BaaS) for data storage and real-time functionality. Designed with a mobile-first approach, the application prioritizes optimization for mobile devices, providing core features inspired by Facebook, such as sharing posts and liking them.\r\n\r\n<div class=\"image columns-1 sm:columns-2 gap-8\">\r\n\r\n\r\n![React 02.](/images/project/01.jpg)\r\n![React 04.](/images/project/01-01.jpg)\r\n\r\n</div>\r\n\r\nFor data storage, the application uses a NoSQL Firebase database. User data, such as account creation information, is temporarily stored in the local session (e.g., localStorage or sessionStorage) and then sent to Firebase for permanent storage. Posts and other content-related data are retrieved from Firebase through API calls, often referred to as \"gates.\" These are then integrated into the app's state, which is managed using Redux, ensuring a consistent and efficient flow of information between components.\r\n[Acces live](https://quote.gabrielchiorcea.tech/).\r\n\r\nThe application incorporates modern technologies to achieve its functionality. While React serves as the framework for building the user interface, Sass is used for styling, offering modular and reusable designs. Redux is at the core of the app’s state management, enabling smooth synchronization of data such as posts, likes, and shares. Middleware like Redux Thunk facilitates handling asynchronous API calls to Firebase, ensuring organized and efficient state updates.\r\n\r\nThe user interactions within the app are intuitive and align with familiar patterns from social media platforms. For instance, users can share posts or like them, with these actions updating both the local state and Firebase in real-time. Account creation is straightforward, with user details initially stored locally before being validated and saved in Firebase. Posts and related interactions, once fetched, are synchronized with the Redux Store, making them readily accessible across various parts of the application.\r\n\r\n\r\n## Redux Role in the Application \r\n[Acces live](https://quote.gabrielchiorcea.tech/).\r\n\r\nRedux manages the global state of the application, ensuring synchronization between Firebase and the user interface. Upon initialization, all posts are fetched from Firebase and stored in posts, an array that holds all existing posts.\r\n\r\nThe Redux state structure also includes oldPosts for older posts and newpost for newly created ones. When a user adds a new post, it's first stored in newpost, then added to both posts and jokes to keep the UI up-to-date. This allows real-time updates and ensures smooth content management across the application.\r\n\r\n```javascript\r\n name: 'post',\r\n  initialState: {\r\n    posts: [],\r\n    newPost: [],\r\n    topTen: [],\r\n    oldPost: [],\r\n    wellcomeState: 'empty',\r\n    writtenPost: false,\r\n    existUser: false,\r\n    cookieConsent: false,\r\n    deleteAccount: false,\r\n    error: {\r\n      errorMainArr: false,\r\n      errorMajorArr: false,\r\n      formError: false,\r\n      registration: false,\r\n    },\r\n```\r\n\r\n\r\n## Custom Hook for Post Updates (Like/Dislike)\r\n[Acces live](https://quote.gabrielchiorcea.tech/).\r\n\r\nIn this application, posts are categorized into two types: those containing obscene words and those that are normal. The like/dislike functionality relies on three key parameters: id, type, and url. The id uniquely identifies a post, type specifies whether it's a like or a dislike, and url determines which division the post belongs to (either containing obscene content or not). This url corresponds to different sections in the database, as the posts are stored separately to simplify analysis of the content.\r\n\r\nTo implement this functionality, a custom hook is designed to handle post updates based on user interaction. The process can be broken down as follows:\r\n\r\n\r\n1. Item 1 URL Fetching from env: Based on the provided url (indicating the division), the custom hook retrieves the corresponding URL stored in the environment file (.env). This URL points to the specific division of posts, allowing for clear separation of content that contains obscene words from normal content.\r\n\r\n2. Item 2 Like/Dislike Action: Once the hook receives the type (either \"like\" or \"dislike\"), it triggers an API call to the appropriate division (using the URL retrieved from env). The post’s unique id is used to fetch the relevant post data for processing.\r\n\r\n3. Item 3 Post Comparison and State Update: After fetching the post, the custom hook compares it to the corresponding entry in the oldPosts array (which holds previously fetched post data). If the post has changed—such as when the like/dislike count has been updated—the hook will update the Redux state with the new data. If the post differs from its previous state, it will be added to the posts array in Redux for UI reactivity.\r\n\r\n4. Item 4 Database Synchronization: Once the UI state is updated with the new like/dislike data, the hook ensures the changes are reflected in the Firebase database by sending an update request, ensuring consistency between the frontend and the backend.\r\n\r\n[Acces live](https://quote.gabrielchiorcea.tech/).\r\n\r\n```javascript\r\nimport { postActions } from '../store/post-slice';\r\nimport { useDispatch } from 'react-redux';\r\nconst useUpdate = () => {\r\n  const dispatch = useDispatch();\r\n\r\n  const mapPutVote = async (id, type, url) => {\r\n    const sendId = id;\r\n    const URL = url;\r\n\r\n    let response;\r\n    let comeFrom;\r\n    if (URL === process.env.REACT_APP_URL_POST) {\r\n      comeFrom = 'AllPosts';\r\n      response = await fetch(\r\n        process.env.REACT_APP_PrefixNormalDB + sendId + '.json'\r\n      );\r\n    } else {\r\n      comeFrom = 'MajorPosts';\r\n      response = await fetch(\r\n        process.env.REACT_APP_PrefixMajorDB + sendId + '.json'\r\n      );\r\n    }\r\n    const data = await response.json();\r\n    let notIncremented = data.vote;\r\n    \r\n    let isIncrmented;\r\n\r\n    if (type === 'increment') {\r\n      isIncrmented = ++notIncremented;\r\n    } else if (type === 'decrease' && notIncremented <= 0) {\r\n      isIncrmented = notIncremented;\r\n    } else {\r\n      isIncrmented = --notIncremented;\r\n    }\r\n\r\n    const sendVote = { vote: isIncrmented };\r\n    const newVote = sendVote.vote;\r\n    const sendPayload = {\r\n      comeFrom: comeFrom,\r\n      id: sendId,\r\n      vote: sendVote.vote,\r\n    };\r\n\r\n    let switchedUrl;\r\n\r\n    if (URL === process.env.REACT_APP_URL_BANC) {\r\n      switchedUrl = process.env.REACT_APP_PrefixNormalDB + sendId + '.json';\r\n    } else if (URL === process.env.REACT_APP_URL_MAJOR) {\r\n      switchedUrl = process.env.REACT_APP_PrefixMajorDB + sendId + '.json';\r\n    }\r\n    if (notIncremented > 0) {\r\n      setTimeout(() => {\r\n        fetch(switchedUrl, {\r\n          method: 'PATCH',\r\n          body: JSON.stringify({ vote: newVote }),\r\n        });\r\n      }, 700);\r\n    }\r\n\r\n    dispatch(postActions.upDateOldPosts(sendPayload));\r\n\r\n  };\r\n  return { mapPutVote };\r\n};\r\n\r\nexport default useUpdate;\r\n\r\n```\r\n\r\n\r\n## More\r\n\r\n<div class=\"image columns-1 sm:columns-2 gap-8\">\r\n\r\n![React 03.](/images/project/01-02.jpg)\r\n![React 03.](/images/project/01-03.jpg)\r\n</div>\r\n\r\n\r\n"},"nextProject":{"slug":"react-food-order-app","frontMatter":{"date":"10-10-2024","title":"Meals","lang":"Build with React","description":"This app use the core functionalities of a food ordering application, including menu navigation, cart management, order placement, and administrative controls. It provides a fully functional and attractive interface for users to interact with.","image":"/images/project/07.jpg","color":"#67A94C","category":"Frontend","projectInfo":[{"title":"Client","data":"World wide"},{"title":"Release date","data":"Steel in development, but ready for tests"},{"title":"Tehnology","data":"- React\n- SASS\n- FireBase\n- Redux\n- Router\n- Material-UI\n"},{"title":"Functions","data":"- Authentication and Authorization\n- Data Fetching and API Integration\n- Oder state managemnet\n- Admin/User UI \n"}],"live":[{"link":"https://meals.gabrielchiorcea.tech/"}]},"content":"\n\n\n## Arhitecture. \n\n\n<div class=\"image columns-1 sm:columns-2 gap-8\">\n\n\n![React 02.](/images/project/07.jpg)\n![React 04.](/images/project/07-01.jpg)\n\n</div>\n\n\n\n\n## Description\n\nReact Meals is a web-based food ordering application developed using React and Firebase. This application allows users to browse a menu of available meals, add items to their cart, and place orders. It also includes administrative features for managing product availability.\n\n### Key Features\n1. Menu Navigation and Viewing:\n- Users can view a list of available meals, each with a description, price, and availability status.\n\n2. Add to Cart:\n- Users can add meals to their shopping cart by specifying the desired quantity.\n- The shopping cart is updated in real-time and can be viewed through a dedicated button.\n\n3. Place Orders:\n- Users can place orders by filling out a form with personal and delivery details.\n- Orders are saved in Firebase Realtime Database for further management.\n\n### Administrative Features:\n\nAdmins can manage products, updating their availability directly from the application interface. Administrative features are protected and accessible only to authorized users.\n\n<div class=\"image columns-1 sm:columns-2 gap-8\">\n\n![React 03.](/images/project/07-02.jpg)\n![React 03.](/images/project/07-03.jpg)\n![React 03.](/images/project/07-04.jpg)\n\n</div>\n\n## Technologies Used\n1. React: The main library used for building the user interface.\n2. Redux: State management to ensure a smooth and consistent user experience.\n3. Firebase: Used for authentication and real-time data storage.\n4. React Router: Manages routing and navigation within the application.\n5. Styled Components: Styles React components to create a modern and attractive interface.\n6. Material-UI: A UI component library to accelerate development and ensure design consistency.\n\n## Project Structure\nComponents: Contains all reusable components of the application, such as buttons, forms, and lists.\nPages: Contains the main pages of the application, such as the menu page, cart page, and admin page.\nStore: Contains the Redux configuration and reducers for managing the application's state.\nFirebase: Configuration for Firebase authentication and data storage.\n\n## Redux :\n\n\n```javascript\n\nimport { createSlice } from '@reduxjs/toolkit';\n\nconst initialCartState = {\n  items: [],\n  meals: [],\n  totalAmount: 0,\n  isAdmin: false,\n  stockButton: false,\n  productButton: false,\n  orderButton: true\n\n};\n\nconst orderSlice = createSlice({\n  name: 'order',\n  initialState: initialCartState,\n  reducers: {\n    addItem(state, action) {\n      const newItem = action.payload;\n      const existingItem = state.items.find(item => item.id === newItem.id);\n      state.totalAmount += newItem.price * newItem.amount;\n      if (!existingItem) {\n        state.items.push({\n          id: newItem.id,\n          name: newItem.name,\n          amount: newItem.amount,\n          price: newItem.price,\n        });\n      } else {\n        existingItem.amount += newItem.amount;\n      }\n    },\n    removeItem(state, action) {\n      const id = action.payload;\n      const existingItem = state.items.find(item => item.id === id);\n      state.totalAmount -= existingItem.price;\n      if (existingItem.amount === 1) {\n        state.items = state.items.filter(item => item.id !== id);\n      } else {\n        existingItem.amount--;\n      }\n    },\n    addMeal(state, action) {\n      const newMeal = action.payload;\n      const existingMeal = state.meals.find(meal => meal.id === newMeal.id);\n      if (!existingMeal) {\n        state.meals.push({\n          id: newMeal.id,\n          name: newMeal.name,\n          description: newMeal.description,\n          price: newMeal.price,\n          availability: newMeal.availability,\n        });\n      }\n    },\n    clearCart(state) {\n      state.items = [];\n      state.totalAmount = 0;\n    },\n    loginAdmin(state, action) {\n      state.isAdmin = action.payload;\n    },\n\n    setStockButton(state, action) {\n      state.stockButton = action.payload;\n    },\n\n    setProductButton(state, action) {\n      state.productButton = action.payload;\n    },\n\n    setOrderButton(state, action) {\n      state.orderButton = action.payload;\n    }\n  },\n});\n\nexport const orderActions = orderSlice.actions;\nexport default orderSlice.reducer;\n\n```\n\n1. The order-slice.js file defines the initial state and the reducers for managing the cart state.\n2. The createSlice function from Redux Toolkit is used to create a slice of the state, which includes actions and reducers.\n3. The initial state includes properties like items, meals, totalAmount, isAdmin, stockButton, productButton, and orderButton.\n4. The reducers define how the state should be updated in response to actions. For example, the addItem reducer adds a new item to the cart, and the removeItem reducer removes an item from the cart.\n\n## Configuring the Redux Store:\n\nThe index.js file in the store directory configures the Redux store using the configureStore function from Redux Toolkit. The store is configured with the orderReducer created in the order-slice.js file.\n\nProviding the Redux Store to the Application:\nThe index.js file in the root directory wraps the App component with the Provider component from react-redux and passes the store to it.\nThis makes the Redux store available to all components in the application.\n\nBy using Redux for state management, the React Meals application ensures a predictable and efficient way to manage the application state. Redux helps in maintaining a single source of truth for the state, making it easier to debug and test the application. The use of Redux Toolkit simplifies the setup and reduces boilerplate code, allowing for a more streamlined development process.\n\n\n\n\n"}},"__N_SSG":true}