{"pageProps":{"currentProject":{"slug":"server","frontMatter":{"date":"2009-01-10","title":"Database","description":"A server configurate to have multiple sql server","image":"/images/project/06.jpg","color":"#BE0000","category":"Server","projectInfo":[{"title":"Client","data":"Word Wide"},{"title":"Timeline","data":"In progress"},{"title":"Tehnology","data":"- UFW firewall\n- Ubuntu 20\n- Jenkins\n- Docker\n- MySQL\n- Oracle\n- Microsoft\n"},{"title":"Functions","data":"- Database creation\n- User creation\n- Establish a remote connections\n- Open Database for dev\n"}],"live":[{"link":"#"}]},"content":"\r\n## Description:\r\nThis project focuses on configuring a server to host multiple SQL databases efficiently. It utilizes advanced technologies such as Ubuntu 20, UFW firewall for security, Jenkins for continuous integration, Docker for containerization, and support for diverse database systems including MySQL, Oracle, and Microsoft SQL Server. The primary functions include creating databases, managing user accounts, establishing secure remote connections, and making the databases accessible for development purposes. The project is currently in progress and serves a global client base, ensuring robust and scalable database management solutions tailored to diverse needs.\r\n\r\n\r\n"},"nextProject":{"slug":"react-food-order-app","frontMatter":{"date":"2024-10-10","title":"Meals","lang":"Build with React","description":"This app use the core functionalities of a food ordering application, including menu navigation, cart management, order placement, and administrative controls. It provides a fully functional and attractive interface for users to interact with.","image":"/images/project/07.jpg","color":"#67A94C","category":"Frontend","projectInfo":[{"title":"Client","data":"World wide"},{"title":"Release date","data":"Steel in development, but ready for tests"},{"title":"Tehnology","data":"- React\n- SASS\n- FireBase\n- Redux\n- Router\n- Material-UI\n"},{"title":"Functions","data":"- Authentication and Authorization\n- Data Fetching and API Integration\n- Oder state managemnet\n- Admin/User UI \n"}],"live":[{"link":"https://meals.gabrielchiorcea.tech/"}]},"content":"\n\n\n## Arhitecture. \n\n\n<div className=\"image columns-1 sm:columns-2 gap-8\">\n\n\n![React 02.](/images/project/07.jpg)\n![React 04.](/images/project/07-01.jpg)\n\n</div>\n\n\n\n\n## Description\n\nReact Meals is a web-based food ordering application developed using React and Firebase. This application allows users to browse a menu of available meals, add items to their cart, and place orders. It also includes administrative features for managing product availability.\n\n### Key Features\n1. Menu Navigation and Viewing:\n- Users can view a list of available meals, each with a description, price, and availability status.\n\n2. Add to Cart:\n- Users can add meals to their shopping cart by specifying the desired quantity.\n- The shopping cart is updated in real-time and can be viewed through a dedicated button.\n\n3. Place Orders:\n- Users can place orders by filling out a form with personal and delivery details.\n- Orders are saved in Firebase Realtime Database for further management.\n\n### Administrative Features:\n\nAdmins can manage products, updating their availability directly from the application interface. Administrative features are protected and accessible only to authorized users.\n\n<div className=\"image columns-1 sm:columns-2 gap-8\">\n\n![React 03.](/images/project/07-02.jpg)\n![React 03.](/images/project/07-03.jpg)\n![React 03.](/images/project/07-04.jpg)\n\n</div>\n\n## Technologies Used\n1. React: The main library used for building the user interface.\n2. Redux: State management to ensure a smooth and consistent user experience.\n3. Firebase: Used for authentication and real-time data storage.\n4. React Router: Manages routing and navigation within the application.\n5. Styled Components: Styles React components to create a modern and attractive interface.\n6. Material-UI: A UI component library to accelerate development and ensure design consistency.\n\n## Project Structure\nComponents: Contains all reusable components of the application, such as buttons, forms, and lists.\nPages: Contains the main pages of the application, such as the menu page, cart page, and admin page.\nStore: Contains the Redux configuration and reducers for managing the application's state.\nFirebase: Configuration for Firebase authentication and data storage.\n\n## Redux :\n\n\n```javascript\n\nimport { createSlice } from '@reduxjs/toolkit';\n\nconst initialCartState = {\n  items: [],\n  meals: [],\n  totalAmount: 0,\n  isAdmin: false,\n  stockButton: false,\n  productButton: false,\n  orderButton: true\n\n};\n\nconst orderSlice = createSlice({\n  name: 'order',\n  initialState: initialCartState,\n  reducers: {\n    addItem(state, action) {\n      const newItem = action.payload;\n      const existingItem = state.items.find(item => item.id === newItem.id);\n      state.totalAmount += newItem.price * newItem.amount;\n      if (!existingItem) {\n        state.items.push({\n          id: newItem.id,\n          name: newItem.name,\n          amount: newItem.amount,\n          price: newItem.price,\n        });\n      } else {\n        existingItem.amount += newItem.amount;\n      }\n    },\n    removeItem(state, action) {\n      const id = action.payload;\n      const existingItem = state.items.find(item => item.id === id);\n      state.totalAmount -= existingItem.price;\n      if (existingItem.amount === 1) {\n        state.items = state.items.filter(item => item.id !== id);\n      } else {\n        existingItem.amount--;\n      }\n    },\n    addMeal(state, action) {\n      const newMeal = action.payload;\n      const existingMeal = state.meals.find(meal => meal.id === newMeal.id);\n      if (!existingMeal) {\n        state.meals.push({\n          id: newMeal.id,\n          name: newMeal.name,\n          description: newMeal.description,\n          price: newMeal.price,\n          availability: newMeal.availability,\n        });\n      }\n    },\n    clearCart(state) {\n      state.items = [];\n      state.totalAmount = 0;\n    },\n    loginAdmin(state, action) {\n      state.isAdmin = action.payload;\n    },\n\n    setStockButton(state, action) {\n      state.stockButton = action.payload;\n    },\n\n    setProductButton(state, action) {\n      state.productButton = action.payload;\n    },\n\n    setOrderButton(state, action) {\n      state.orderButton = action.payload;\n    }\n  },\n});\n\nexport const orderActions = orderSlice.actions;\nexport default orderSlice.reducer;\n\n```\n\n1. The order-slice.js file defines the initial state and the reducers for managing the cart state.\n2. The createSlice function from Redux Toolkit is used to create a slice of the state, which includes actions and reducers.\n3. The initial state includes properties like items, meals, totalAmount, isAdmin, stockButton, productButton, and orderButton.\n4. The reducers define how the state should be updated in response to actions. For example, the addItem reducer adds a new item to the cart, and the removeItem reducer removes an item from the cart.\n\n## Configuring the Redux Store:\n\nThe index.js file in the store directory configures the Redux store using the configureStore function from Redux Toolkit. The store is configured with the orderReducer created in the order-slice.js file.\n\nProviding the Redux Store to the Application:\nThe index.js file in the root directory wraps the App component with the Provider component from react-redux and passes the store to it.\nThis makes the Redux store available to all components in the application.\n\nBy using Redux for state management, the React Meals application ensures a predictable and efficient way to manage the application state. Redux helps in maintaining a single source of truth for the state, making it easier to debug and test the application. The use of Redux Toolkit simplifies the setup and reduces boilerplate code, allowing for a more streamlined development process.\n\n\n\n\n"}},"__N_SSG":true}